TexasInstruments/enet-firmware/apps/app_remoteswitchcfg_server/sitara/am62px-sk/wkup-r5fss0-0_freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM62Px" --part "Default" --package "AMH" --context "wkup-r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @v2CliArgs --device "AM62P" --package "FCBGA (AMH)" --variant "AM62P54-M" --context "wkup-r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.24.2+4234"}
 */

/**
 * Import the modules used in this configuration.
 */
const eeprom      = scripting.addModule("/board/eeprom/eeprom", {}, false);
const eeprom1     = eeprom.addInstance();
const flash       = scripting.addModule("/board/flash/flash", {}, false);
const flash1      = flash.addInstance();
const bootloader  = scripting.addModule("/drivers/bootloader/bootloader", {}, false);
const bootloader1 = bootloader.addInstance();
const bootloader2 = bootloader.addInstance();
const bootloader3 = bootloader.addInstance();
const gtc         = scripting.addModule("/drivers/gtc/gtc");
const i2c         = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1        = i2c.addInstance();
const ipc         = scripting.addModule("/drivers/ipc/ipc");
const uart        = scripting.addModule("/drivers/uart/uart", {}, false);
const uart1       = uart.addInstance();
const clock       = scripting.addModule("/kernel/dpl/clock");
const debug_log   = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7   = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71  = mpu_armv7.addInstance();
const mpu_armv72  = mpu_armv7.addInstance();
const mpu_armv73  = mpu_armv7.addInstance();
const mpu_armv74  = mpu_armv7.addInstance();
const mpu_armv75  = mpu_armv7.addInstance();
const mpu_armv76  = mpu_armv7.addInstance();
const mpu_armv77  = mpu_armv7.addInstance();
const mpu_armv78  = mpu_armv7.addInstance();
const mpu_armv79  = mpu_armv7.addInstance();
const mpu_armv710 = mpu_armv7.addInstance();
const mpu_armv711 = mpu_armv7.addInstance();
const mpu_armv712 = mpu_armv7.addInstance();
const mpu_armv713 = mpu_armv7.addInstance();
const enet_cpsw   = scripting.addModule("/networking/enet_cpsw/enet_cpsw", {}, false);
const enet_cpsw1  = enet_cpsw.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
eeprom1.$name = "CONFIG_EEPROM0";

bootloader1.appImageOffset = "0x240000";
bootloader1.$name          = "CONFIG_BOOTLOADER_FLASH_HSM";

bootloader2.$name          = "CONFIG_BOOTLOADER_FLASH_MCU";
bootloader2.appImageOffset = "0x800000";

bootloader3.appImageOffset = "0x1200000";
bootloader3.$name          = "CONFIG_BOOTLOADER_FLASH_LINUX";

bootloader1.flashDriver                                 = flash1;
bootloader2.flashDriver                                 = flash1;
bootloader3.flashDriver                                 = flash1;
flash1.$name                                            = "CONFIG_FLASH_SBL";
flash1.serialFlashDriver.$name                          = "board_flash_serialFlash_serialflash0";
flash1.serialFlashDriver.peripheralDriver.dmaEnable     = true;
flash1.serialFlashDriver.peripheralDriver.phyEnable     = true;
flash1.serialFlashDriver.peripheralDriver.$name         = "CONFIG_OSPI_SBL";
flash1.serialFlashDriver.peripheralDriver.phySkipTuning = true;

i2c1.$name                      = "CONFIG_I2C0";
eeprom1.peripheralDriver        = i2c1;
i2c1.useWakeupDomainPeripherals = false;
i2c1.I2C_child.$name            = "drivers_i2c_v0_i2c_v0_template1";
i2c1.I2C.$assign                = "I2C0";

uart1.$name                      = "CONFIG_UART_SBL";
uart1.useWakeupDomainPeripherals = false;
uart1.intrEnable                 = "DISABLE";
uart1.addedByBootloader          = true;
uart1.UART.$assign               = "USART0";

const udma                                           = scripting.addModule("/drivers/udma/udma", {}, false);
const udma1                                          = udma.addInstance({}, false);
udma1.$name                                          = "CONFIG_UDMA0";
bootloader1.udmaDriver                               = udma1;
flash1.serialFlashDriver.peripheralDriver.udmaDriver = udma1;
bootloader2.udmaDriver                               = udma1;
bootloader3.udmaDriver                               = udma1;

const udma_blkcopy_channel                                   = scripting.addModule("/drivers/udma/udma_blkcopy_channel", {}, false);
const udma_blkcopy_channel1                                  = udma_blkcopy_channel.addInstance({}, false);
udma_blkcopy_channel1.$name                                  = "CONFIG_UDMA_BLKCOPY_CH0";
bootloader1.udmaBlkCopyChannel                               = udma_blkcopy_channel1;
flash1.serialFlashDriver.peripheralDriver.udmaBlkCopyChannel = udma_blkcopy_channel1;
bootloader2.udmaBlkCopyChannel                               = udma_blkcopy_channel1;
bootloader3.udmaBlkCopyChannel                               = udma_blkcopy_channel1;

debug_log.enableUartLog      = true;
debug_log.enableCssLog       = false;
debug_log.uartLog.intrEnable = "DISABLE";
debug_log.uartLog.$name      = "CONFIG_UART_APP";

mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.$name             = "REGISTER_REGION";

mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv72.size              = 7;
mpu_armv72.$name             = "TCMA_VEC";

mpu_armv73.$name    = "DDR";
mpu_armv73.baseAddr = 0x80000000;
mpu_armv73.size     = 31;

mpu_armv74.baseAddr   = 0x41010000;
mpu_armv74.size       = 15;
mpu_armv74.attributes = "NonCached";
mpu_armv74.$name      = "TCMB";

mpu_armv75.size       = 15;
mpu_armv75.attributes = "NonCached";
mpu_armv75.$name      = "TCMA";

mpu_armv76.baseAddr = 0x43C00000;
mpu_armv76.size     = 18;
mpu_armv76.$name    = "HSM_RAM";

mpu_armv77.$name        = "LINUX_VRING";
mpu_armv77.baseAddr     = 0x9C800000;
mpu_armv77.attributes   = "NonCached";
mpu_armv77.size         = 20;
mpu_armv77.allowExecute = false;

mpu_armv78.attributes   = "NonCached";
mpu_armv78.size         = 20;
mpu_armv78.allowExecute = false;
mpu_armv78.baseAddr     = 0x9C900000;
mpu_armv78.$name        = "RESOURCE_TABLE_AND_TRACE";

mpu_armv79.baseAddr     = 0x9B500000;
mpu_armv79.allowExecute = false;
mpu_armv79.attributes   = "NonCached";
mpu_armv79.$name        = "RTOS_NORTOS_IPC_VRING1";
mpu_armv79.size         = 20;

mpu_armv710.$name        = "RTOS_NORTOS_IPC_VRING2";
mpu_armv710.baseAddr     = 0x9B600000;
mpu_armv710.size         = 21;
mpu_armv710.allowExecute = false;
mpu_armv710.attributes   = "NonCached";

mpu_armv711.$name        = "FSS0_OSPI0_CTRL_REG";
mpu_armv711.baseAddr     = 0xFC40000;
mpu_armv711.size         = 8;
mpu_armv711.attributes   = "Device";
mpu_armv711.allowExecute = false;

mpu_armv712.$name        = "UART0_REG";
mpu_armv712.baseAddr     = 0x2800000;
mpu_armv712.size         = 9;
mpu_armv712.attributes   = "Device";
mpu_armv712.allowExecute = false;

mpu_armv713.$name      = "INTERCORE_REGION";
mpu_armv713.size       = 25;
mpu_armv713.baseAddr   = 0xA4000000;
mpu_armv713.attributes = "NonCached";

enet_cpsw1.$name                               = "CONFIG_ENET_CPSW0";
enet_cpsw1.IsEthFw                             = true;
enet_cpsw1.PktInfoOnlyEnable                   = true;
enet_cpsw1.cpswVlanAwareMode                   = true;
enet_cpsw1.vlanId_hostPort                     = 0x1;
enet_cpsw1.vlanId_macPort1                     = 0x3;
enet_cpsw1.vlanId_macPort2                     = 0x3;
enet_cpsw1.macport1RxMtu                       = 1522;
enet_cpsw1.macport2RxMtu                       = 1522;
enet_cpsw1.hostportRxMtu                       = 1522;
enet_cpsw1.macAddrConfig                       = "Manual Entry";
enet_cpsw1.LargePoolPktCount                   = 64;
enet_cpsw1.macAddrList                         = "70:ff:76:1d:ec:f2,70:ff:76:1d:ec:e3,70:ff:76:1d:ec:e4,70:ff:76:1d:ec:e6,70:ff:76:1d:ec:e7,70:ff:76:1d:ec:e8";
enet_cpsw1.txDmaChannel.create(2);
enet_cpsw1.txDmaChannel[0].$name               = "ENET_DMA_TX_CH0";
enet_cpsw1.txDmaChannel[1].$name               = "ENET_DMA_TX_CH_PTP";
enet_cpsw1.rxDmaChannel.create(3);
enet_cpsw1.rxDmaChannel[0].$name               = "ENET_DMA_RX_CH0";
enet_cpsw1.rxDmaChannel[0].PacketsCount        = 16;
enet_cpsw1.rxDmaChannel[0].useGlobalEvt        = true;
enet_cpsw1.rxDmaChannel[1].$name               = "ENET_DMA_RX_CH1";
enet_cpsw1.rxDmaChannel[1].macAddrCount        = 0;
enet_cpsw1.rxDmaChannel[1].useDefaultFlow      = false;
enet_cpsw1.rxDmaChannel[1].PacketsCount        = 16;
enet_cpsw1.rxDmaChannel[1].useGlobalEvt        = true;
enet_cpsw1.rxDmaChannel[2].$name               = "ENET_DMA_RX_CH_PTP";
enet_cpsw1.rxDmaChannel[2].useDefaultFlow      = false;
enet_cpsw1.rxDmaChannel[2].PacketsCount        = 16;
enet_cpsw1.rxDmaChannel[2].useGlobalEvt        = true;
enet_cpsw1.rxDmaChannel[2].macAddrCount        = 0;
enet_cpsw1.netifInstance.create(1);
enet_cpsw1.netifInstance[0].$name              = "NETIF_INST_ID0";
enet_cpsw1.netifInstance[0].enableProxyArp     = true;
enet_cpsw1.netifInstance[0].proxyArpRxDmaChNum = ["1"];

const ethphy_cpsw_icssg  = scripting.addModule("/board/ethphy_cpsw_icssg/ethphy_cpsw_icssg", {}, false);
const ethphy_cpsw_icssg1 = ethphy_cpsw_icssg.addInstance({}, false);
ethphy_cpsw_icssg1.$name = "CONFIG_ENET_ETHPHY0";
enet_cpsw1.ethphy1       = ethphy_cpsw_icssg1;

const ethphy_cpsw_icssg2 = ethphy_cpsw_icssg.addInstance({}, false);
ethphy_cpsw_icssg2.$name = "CONFIG_ENET_ETHPHY1";
enet_cpsw1.ethphy2       = ethphy_cpsw_icssg2;

const udma2        = udma.addInstance({}, false);
enet_cpsw1.udmaDrv = udma2;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
flash1.serialFlashDriver.peripheralDriver.OSPI.$suggestSolution      = "OSPI0";
flash1.serialFlashDriver.peripheralDriver.OSPI.CLK.$suggestSolution  = "OSPI0_CLK";
flash1.serialFlashDriver.peripheralDriver.OSPI.CSn0.$suggestSolution = "OSPI0_CSn0";
flash1.serialFlashDriver.peripheralDriver.OSPI.DQS.$suggestSolution  = "OSPI0_DQS";
flash1.serialFlashDriver.peripheralDriver.OSPI.D7.$suggestSolution   = "OSPI0_D7";
flash1.serialFlashDriver.peripheralDriver.OSPI.D6.$suggestSolution   = "OSPI0_D6";
flash1.serialFlashDriver.peripheralDriver.OSPI.D5.$suggestSolution   = "OSPI0_D5";
flash1.serialFlashDriver.peripheralDriver.OSPI.D4.$suggestSolution   = "OSPI0_D4";
flash1.serialFlashDriver.peripheralDriver.OSPI.D3.$suggestSolution   = "OSPI0_D3";
flash1.serialFlashDriver.peripheralDriver.OSPI.D2.$suggestSolution   = "OSPI0_D2";
flash1.serialFlashDriver.peripheralDriver.OSPI.D1.$suggestSolution   = "OSPI0_D1";
flash1.serialFlashDriver.peripheralDriver.OSPI.D0.$suggestSolution   = "OSPI0_D0";
i2c1.I2C.SCL.$suggestSolution                                        = "I2C0_SCL";
i2c1.I2C.SDA.$suggestSolution                                        = "I2C0_SDA";
uart1.UART.RXD.$suggestSolution                                      = "UART0_RXD";
uart1.UART.TXD.$suggestSolution                                      = "UART0_TXD";
debug_log.uartLog.WKUP_UART.$suggestSolution                         = "WKUP_USART0";
debug_log.uartLog.WKUP_UART.RXD.$suggestSolution                     = "WKUP_UART0_RXD";
debug_log.uartLog.WKUP_UART.TXD.$suggestSolution                     = "WKUP_UART0_TXD";
enet_cpsw1.MDIO.$suggestSolution                                     = "MDIO0";
enet_cpsw1.MDIO.MDC.$suggestSolution                                 = "MDIO0_MDC";
enet_cpsw1.MDIO.MDIO.$suggestSolution                                = "MDIO0_MDIO";
enet_cpsw1.RGMII1.$suggestSolution                                   = "RGMII2";
enet_cpsw1.RGMII1.RD0.$suggestSolution                               = "RGMII2_RD0";
enet_cpsw1.RGMII1.RD1.$suggestSolution                               = "RGMII2_RD1";
enet_cpsw1.RGMII1.RD2.$suggestSolution                               = "RGMII2_RD2";
enet_cpsw1.RGMII1.RD3.$suggestSolution                               = "RGMII2_RD3";
enet_cpsw1.RGMII1.RX_CTL.$suggestSolution                            = "RGMII2_RX_CTL";
enet_cpsw1.RGMII1.RXC.$suggestSolution                               = "RGMII2_RXC";
enet_cpsw1.RGMII1.TD0.$suggestSolution                               = "RGMII2_TD0";
enet_cpsw1.RGMII1.TD1.$suggestSolution                               = "RGMII2_TD1";
enet_cpsw1.RGMII1.TD2.$suggestSolution                               = "RGMII2_TD2";
enet_cpsw1.RGMII1.TD3.$suggestSolution                               = "RGMII2_TD3";
enet_cpsw1.RGMII1.TX_CTL.$suggestSolution                            = "RGMII2_TX_CTL";
enet_cpsw1.RGMII1.TXC.$suggestSolution                               = "RGMII2_TXC";
enet_cpsw1.RGMII2.$suggestSolution                                   = "RGMII1";
enet_cpsw1.RGMII2.RD0.$suggestSolution                               = "RGMII1_RD0";
enet_cpsw1.RGMII2.RD1.$suggestSolution                               = "RGMII1_RD1";
enet_cpsw1.RGMII2.RD2.$suggestSolution                               = "RGMII1_RD2";
enet_cpsw1.RGMII2.RD3.$suggestSolution                               = "RGMII1_RD3";
enet_cpsw1.RGMII2.RX_CTL.$suggestSolution                            = "RGMII1_RX_CTL";
enet_cpsw1.RGMII2.RXC.$suggestSolution                               = "RGMII1_RXC";
enet_cpsw1.RGMII2.TD0.$suggestSolution                               = "RGMII1_TD0";
enet_cpsw1.RGMII2.TD1.$suggestSolution                               = "RGMII1_TD1";
enet_cpsw1.RGMII2.TD2.$suggestSolution                               = "RGMII1_TD2";
enet_cpsw1.RGMII2.TD3.$suggestSolution                               = "RGMII1_TD3";
enet_cpsw1.RGMII2.TX_CTL.$suggestSolution                            = "RGMII1_TX_CTL";
enet_cpsw1.RGMII2.TXC.$suggestSolution                               = "RGMII1_TXC";
